---
Description: Expand and transform the latest NVD CPE Dictionary XML
Identifier: com.github.jgstew.process.NVD-CPE-Dictionary-XML
Input:
  NAME: NVD-CPE-Dictionary-XML
MinimumVersion: "2.3"
ParentRecipe: com.github.jgstew.download.NVD-CPE-Dictionary-XML
Process:
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  - Processor: com.github.jgstew.SharedProcessors/FileGetExecutable
    Arguments:
      path_array: [
          # Exe in current directory:
          "7z",
          "7z.exe",
          # MacOS typical:
          # NONINTERACTIVE=1 brew install p7zip
          "/opt/homebrew/bin/7z",
          "/usr/local/bin/7z",
          # NONINTERACTIVE=1 brew install sevenzip
          "/usr/local/bin/7zz",
          # Ubuntu typical:
          # sudo apt-get install -y p7zip-full
          "/usr/bin/7z",
          # Windows typical:
          # choco install -y 7zip
          "/Program Files/7-Zip/7z.exe",
          "/Program Files (x86)/7-Zip/7z.exe",
        ]
  - Processor: com.github.hansen-m.SharedProcessors/WinInstallerExtractor
    Arguments:
      preserve_paths: False
      extract_dir: "downloads"
  - Processor: com.github.jgstew.SharedProcessors/FileTextSearcher
    Arguments:
      # get the unique sorted set of vendor:product parts of CPEs, put in file
      search_pattern: '(?i)"cpe:2.3:a:(\w+:\w+):'
      search_path: "%RECIPE_CACHE_DIR%/downloads"
      search_extension: ".xml"
      output_file_path: "/tmp/cpe-vendor-product.txt"
  # - Processor: com.github.jgstew.SharedProcessors/FileTextSearcher
  #   Arguments:
  #     # get total number of CPEs for apps (about 725627 or more in the future)
  #     search_pattern: '(?i)"cpe:2.3:a:'
  #     output_file_path: ""
  #     sort_results: False
  #     unique_results_only: False
