---
Description: Generates a BigFix Task for running the latest log4j2-scan
Identifier: com.github.jgstew.bigfix.log4j2-scan-Universal
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: log4j2-scan
  DisplayName: log4j2-scan
# MinimumVersion of AutoPkg - Should always be 2.3 (or higher once a new version is released)
MinimumVersion: "2.3"
ParentRecipe: com.github.jgstew.download.log4j2-scan-Universal
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  # `BigFixPrefetchItem` takes the hashes from `URLDownloaderPython`
  #   Then it assembles them into a BigFix Prefetch Statement or Block
  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem
    Arguments:
      prefetch_type: block

  # `BigFixSetupTemplateDictionary` creates a dictionary to fill out a bigix content template
  #   If `SourceReleaseDate` is not provided, it will be set to today
  - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary

  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppendInput

  # Build "community" versions of each, without the Community Test descriptions
  #####
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "communityversion"
      append_value: "true"

  # "scan_or_remediate" key is common to both Scan and Remediate tasks
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "scan_or_remediate"
      append_value: "True"

  # `ContentFromTemplate` generates bigfix content from a mustache template file
  #   The file is filled out with variables from the Template Dictionary
  #   If variables are missing from the Template Dictionary, then that area will be blank
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "scan"
      append_value: "scan"

  # `ContentFromTemplate` generates bigfix content from a mustache template file
  #   The file is filled out with variables from the Template Dictionary
  #   If variables are missing from the Template Dictionary, then that area will be blank
  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      template_file_path: "./%VendorFolder%/%NAME%-Universal-run.bes.mustache"
      content_file_pathname: "%RECIPE_CACHE_DIR%/Logpresso Log4j2-scan - Universal.bes"

  # `BESImport` imports the generated BES content into a BigFix Server
  #   Which server and credentials are used is dictated by `~/.besapi.conf`
  - Processor: com.github.jgstew.SharedProcessors/BESImport


  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "scan"
      append_value: ""

  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "remediate"
      append_value: "--force-fix"

  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      # template_file_path: "%template_file_path%"
      content_file_pathname: "%RECIPE_CACHE_DIR%/Logpresso Log4j2-scan - Universal - Remediate.bes"

  - Processor: com.github.jgstew.SharedProcessors/BESImport

  # Build "Undo-Remediation" version of fixlet by removing the common "scan_or_remediate" key and the 'remediate' key and adding 'undo-remediate' key
  # - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryRemove
  #   Arguments:
  #     remove_key: "remediate"
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "scan_or_remediate"
      append_value: ""

  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "remediate"
      append_value: ""

  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "undo-remediate"
      append_value: "undo-remediate"

  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      # template_file_path: "%template_file_path%"
      content_file_pathname: "%RECIPE_CACHE_DIR%/Logpresso Log4j2-scan - Universal - UNDO Remediation.bes"

  - Processor: com.github.jgstew.SharedProcessors/BESImport
