---
Description: Downloads the latest version of log4j2-scan
Identifier: com.github.jgstew.download.log4j2-scan-Universal-JRE
Input:
  NAME: "log4j2-scan"
  # TYPE must be `zip` or `7z` or `tar.gz`
  TYPE: jar
  OS: ""
  version: "2.6.1"
MinimumVersion: "2.3"
ParentRecipe: com.github.jgstew.download.log4j2-scan-Win64
Process:
  - Processor: EndOfCheckPhase
