---
Description: Downloads the latest version of log4j2-scan
Identifier: com.github.jgstew.download.log4j2-scan-Win64
Input:
  NAME: "log4j2-scan"
  # TYPE must be `zip` or `7z` or `tar.gz`
  TYPE: "zip"
  OS: -win64
  log4j2scan-common-parameters: "--scan-log4j1 --no-symlink --no-empty-report"
MinimumVersion: "2.3"
ParentRecipe: com.github.jgstew.shared.parent-recipe
Process:
  # see: https://github.com/logpresso/CVE-2021-44228-Scanner/releases
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: logpresso/CVE-2021-44228-Scanner
      asset_regex: "logpresso-log4j2-scan-.*%OS%\\.%TYPE%$"
      include_prereleases: False
      # curl_opts: ["--raw"]
  - Processor: URLDownloaderPython
    Arguments:
      filename: logpresso-log4j2-scan%OS%.%TYPE%
      download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
