---
Description: Downloads the latest version of log4j2-scan
Identifier: com.github.jgstew.download.log4j2-scan-Mac
Input:
  NAME: log4j2-scan-mac
  # TYPE must be `zip` or `7z` or `tar.gz`
  TYPE: zip
  OS: -darwin
MinimumVersion: "2.3"
ParentRecipe: com.github.jgstew.download.log4j2-scan-Win64
Process:
  - Processor: EndOfCheckPhase
