---
Description: Downloads the latest version of log4j2-scan
Identifier: com.github.jgstew.download.log4j2-scan-Linux
Input:
  NAME: "log4j2-scan"
  # TYPE must be `zip` or `7z` or `tar.gz`
  TYPE: tar.gz
  OS: -linux
MinimumVersion: "2.3"
ParentRecipe: com.github.jgstew.download.log4j2-scan-Win64
Process:
  - Processor: EndOfCheckPhase
