---
# https://github.com/autopkg/recipes/blob/master/AutoPkg/AutoPkgGitMaster.nupkg.recipe
Description: Build Chocolatey package for released AutoPkg
Identifier: com.github.jgstew.nupkg.AutoPkg
Input:
  NAME: AutoPkg
MinimumVersion: "2.3"
Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      # https://github.com/autopkg/autopkg/releases/tag/v2.4.1
      # https://github.com/autopkg/autopkg/archive/refs/tags/v2.4.1.zip
      github_repo: autopkg/autopkg
      asset_regex: "*.zip"
  # work in progress
  - Processor: EndOfCheckPhase
