---
Description: Downloads the latest GIT for Windows x64
Identifier: com.github.jgstew.download.Git-Win64
Input:
  NAME: GitWin64
MinimumVersion: "2.3"
Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: git-for-windows/git
      asset_regex: Git-.*-64-bit.exe
  - Processor: URLDownloaderPython
    Arguments:
      download_version: "%version%"
  - Processor: EndOfCheckPhase
