---
Description: Downloads the latest BigFix Agent for MacOS 10.14+ (less than 11.x)
Identifier: com.github.jgstew.download.BigFix-Agent-MacOS10
Input:
  NAME: BigFix-Agent-MacOS10
MinimumVersion: '2.3'
Process:
  - Processor: com.github.jgstew.SharedProcessors/URLTextSearcherArray
    Arguments:
      url: https://support.bigfix.com/bes/release/index.html
      re_pattern: '>(?P<version>10\.\d+\.\d+\.\d+)<'

  - Processor: com.github.jgstew.SharedProcessors/VersionMaximumArray

  - Processor: com.github.jgstew.SharedProcessors/VersionGetMajorMinor
    Arguments:
      separator_string: ""

  - Processor: URLDownloaderPython
    Arguments:
      # https://software.bigfix.com/download/bes/100/BESAgent-10.0.15.70-BigFix_MacOSX10.14.pkg
      url: https://software.bigfix.com/download/bes/%version_major_minor%/BESAgent-%version_maximum%-BigFix_MacOSX10.14.pkg
      download_version: "%version_maximum%"
      COMPUTE_HASHES: True

  - Processor: EndOfCheckPhase
