---
Description: Downloads the latest BigFix Agent for Windows
Identifier: com.github.jgstew.download.BigFix-Agent-Win
Input:
  NAME: BigFix-Agent-Win
MinimumVersion: '2.3'
Process:
  - Processor: com.github.jgstew.SharedProcessors/URLTextSearcherArray
    Arguments:
      url: https://support.bigfix.com/bes/release/index.html
      re_pattern: '>(?P<version>\d+\.\d+\.\d+\.\d+)<'

  - Processor: com.github.jgstew.SharedProcessors/VersionMaximumArray

  - Processor: com.github.jgstew.SharedProcessors/VersionGetMajorMinor
    Arguments:
      separator_string: ""

  - Processor: URLDownloaderPython
    Arguments:
      url: https://software.bigfix.com/download/bes/%version_major_minor%/BigFix-BES-Client-%version_maximum%.exe
      download_version: "%version_maximum%"
      COMPUTE_HASHES: True

  - Processor: EndOfCheckPhase
