---
Description: Downloads the latest episode of the BigFix Podcast
Identifier: com.github.jgstew.download.BigFix-Podcast
Input:
  NAME: BigFix-Podcast
MinimumVersion: '2.3'
Process:
  - Processor: URLTextSearcher
    Arguments:
      url: https://feeds.buzzsprout.com/1248878.rss
      re_pattern: 'enclosure url="(?P<url>https://www.buzzsprout.com/.+.mp3)" length="\d+"'

  - Processor: URLDownloaderPython
    Arguments:
      # url: https://www.buzzsprout.com/1248878/13899237-bigfix-insider-interview-michelle-mcgough-bigfix-technical-engagement.mp3
      download_version: ""
      COMPUTE_HASHES: True
      User_Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/117.0

  - Processor: EndOfCheckPhase
