---
Description: Downloads the latest BigFix Fixlet Debugger
Identifier: com.github.jgstew.download.FixletDebugger
Input:
  NAME: FixletDebugger
  # version_major_minor_match: "9.5"
MinimumVersion: "2.3"
Process:
  - Processor: com.github.jgstew.SharedProcessors/URLTextSearcherArray
    Arguments:
      url: https://support.bigfix.com/bes/release/index.html
      re_pattern: '>(?P<version>\d+\.\d+\.\d+\.\d+)<'
  - Processor: com.github.jgstew.SharedProcessors/VersionMaximumArray
  - Processor: com.github.jgstew.SharedProcessors/VersionGetMajorMinor
    Arguments:
      separator_string: ""
  - Processor: URLDownloaderPython
    Arguments:
      url: https://software.bigfix.com/download/bes/%version_major_minor%/util/QNA%version_maximum%.zip
      download_version: "%version_maximum%"
      COMPUTE_HASHES: True
  - Processor: com.github.jgstew.SharedProcessors/VersionGetMajorMinor
    Arguments:
      separator_string: "."
  - Processor: EndOfCheckPhase
