---
Description: Downloads the latest DesktopConnector
Identifier: com.github.jgstew.download.DesktopConnector-Win
Input:
  NAME: DesktopConnector
MinimumVersion: "2.3"
ParentRecipe: com.github.jgstew.shared.parent-recipe
Process:
  - Processor: URLTextSearcher
    Arguments:
      url: https://help.autodesk.com/cloudhelp/ENU/CONNECT-Whats-New/files/GUID-03D59AAD-65B0-45E3-84F2-A12AAA5BB267.htm
      # example match `November 11, 2024 (v.16.11.1.2320)`
      re_pattern: 'v\.(?P<version>\d+(\.\d+)+)'
      # curl_opts: ["-A", "Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/117.0"]

  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      url: https://www.autodesk.com/adsk-connect-64
      COMPUTE_HASHES: True
      filename: DesktopConnector-x64.exe
      download_version: ""
      User_Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/117.0

  - Processor: EndOfCheckPhase

  # - Processor: com.github.jgstew.SharedProcessors/FileGetExecutable
  #   Arguments:
  #     path_array: [
  #         # Exe in current directory:
  #         "7z",
  #         "7z.exe",
  #         # MacOS typical:
  #         # NONINTERACTIVE=1 brew install p7zip
  #         "/opt/homebrew/bin/7z",
  #         "/usr/local/bin/7z",
  #         # NONINTERACTIVE=1 brew install sevenzip
  #         "/usr/local/bin/7zz",
  #         # Ubuntu typical:
  #         # sudo apt-get install -y p7zip-full
  #         "/usr/bin/7z",
  #         # Windows typical:
  #         # choco install -y 7zip
  #         "/Program Files/7-Zip/7z.exe",
  #         "/Program Files (x86)/7-Zip/7z.exe",
  #       ]

  # - Processor: com.github.hansen-m.SharedProcessors/WinInstallerExtractor
  #   Arguments:
  #     extract_dir: "tmp"

  # If you extract DesktopConnector-x64.exe there is a file within it called Autodesk_Desktop_Connector_002_002.7z and if you extract that then there is a file within it called setup.xml which has the version number inside of it.
