---
Description: This recipe is meant to be the parent recipe of all download recipes and help setup shared items and vars
Identifier: com.github.jgstew.shared.parent-recipe
Input:
  NAME: "SHARED-PARENT-RECIPE"
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
  - Processor: com.github.jgstew.SharedProcessors/GetRecipeParentFolderName
