---
Description: Downloads the latest Windows Update Catalog
Identifier: com.github.jgstew.download.WindowsUpdateCatalog
Input:
  NAME: WindowsUpdateCatalog
MinimumVersion: '2.3'
Process:
  - Processor: URLDownloader
    Arguments:
      url: http://download.windowsupdate.com/microsoftupdate/v6/wsusscan/wsusscn2.cab
  - Processor: EndOfCheckPhase
# Related:
# - https://docs.microsoft.com/en-us/windows/win32/wua_sdk/searching--downloading--and-installing-updates
# - https://docs.microsoft.com/en-us/windows/win32/wua_sdk/using-wua-to-scan-for-updates-offline
