---
Description: Downloads the latest version of Audacity for Windows
# based upon https://github.com/autopkg/ahousseini-recipes/blob/master/Audacity/Audacity.download.recipe
Identifier: com.github.jgstew.download.Audacity-Win
Input:
  NAME: Audacity
MinimumVersion: "2.3"
Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: audacity/audacity
      asset_regex: .*64bit\.exe$
      include_prereleases: False
  - Processor: URLDownloaderPython
    Arguments:
      filename: "audacity-win-64bit.exe"
  - Processor: EndOfCheckPhase
