---
Description: Downloads the latest version of Audacity for Windows
# based upon https://github.com/autopkg/ahousseini-recipes/blob/master/Audacity/Audacity.download.recipe
Identifier: com.github.jgstew.download.Audacity-Win
Input:
  NAME: "Audacity"
  # TYPE must be `exe` or `zip`
  TYPE: "exe"
MinimumVersion: '2.3'
Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: audacity/audacity
      asset_regex: .*64bit\.%TYPE%$
      include_prereleases: False
      # curl_opts: ["--raw"]
  - Processor: URLDownloaderPython
    Arguments:
      download_version: "%version%"
  - Processor: EndOfCheckPhase
