---
Description: Gets the version from the Nessus Windows 64bit agent
# based upon https://github.com/autopkg/neilmartin83-recipes/blob/master/Tenable/Nessus%20Agent.download.recipe
Identifier: com.github.jgstew.versionwin.Nessus-Agent-Win64
Input:
  NAME: Nessus-Agent-Win64
MinimumVersion: '2.3'
ParentRecipe: com.github.jgstew.download.Nessus-Agent-Win64
Process:
  - Processor: com.github.jgstew.SharedProcessors/WinGetPropertyMSI
