---
Description: Generates a BigFix Task for the latest DataDog Agent
Identifier: com.github.jgstew.bigfix.DataDog-Win
Input:
  NAME: DataDogAgent-Win
  DisplayName: Datadog Agent
  64BitOnly: TRUE
MinimumVersion: "2.3"
ParentRecipe: com.github.jgstew.download.DataDog-Agent-Win
Process:
  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem

  - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary
    # Arguments:
    #   template_version: "%version_maximum%"

  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppendInput

  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      # use UNIX style paths so this works on Windows and non-Windows:
      template_file_path: ./DataDog/DataDogAgent-Win-Install_Update.bes.mustache
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%-InstallUpdate.bes"

  - Processor: com.github.jgstew.SharedProcessors/BESImport

  - Processor: com.github.jgstew.SharedProcessors/BigFixActioner

  # create update(patch) only content:
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "patch"
      append_value: true

  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      # template_file_path: "./%VendorFolder%/%NAME%-Win-Install_Update.bes.mustache"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%-Update.bes"
