# https://download.mozilla.org/?product=firefox-latest-ssl&os=osx&lang=en-US
---
Description: Creates an choco package for the latest version of Firefox
Identifier: com.github.jgstew.bigfix.Firefox-Win64
Input:
  NAME: "Firefox"
  DisplayName: "Mozilla Firefox"
  product: firefox-latest-ssl
  OS: win64
  filename: FirefoxSetup.exe
  # https://download.mozilla.org/?product=firefox-latest-ssl&os=linux64&lang=en-US
  # https://download.mozilla.org/?product=firefox-msi-latest-ssl&os=win64&lang=en-US
MinimumVersion: "2.3"
ParentRecipe: com.github.jgstew.download.Firefox-Win64
Process:
  # - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem

  # - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary

  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppendInput

  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      filename: "%NAME%-icon.png"
      url: https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Firefox_logo%2C_2019.svg/200px-Firefox_logo%2C_2019.svg.png
      COMPUTE_HASHES: false

  - Processor: com.github.jgstew.SharedProcessors/FileGetBase64

  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "icon_base64"
      append_value: "%file_base64%"

  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      # use UNIX style paths so this works on Windows and non-Windows:
      template_file_path: ./Mozilla/Firefox-Win-Install_Update.bes.mustache
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%-InstallUpdate.bes"

  - Processor: com.github.jgstew.SharedProcessors/BESImport

  - Processor: com.github.jgstew.SharedProcessors/BigFixActioner

  # create update(patch) only content:
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: "patch"
      append_value: true

  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      # template_file_path: "./%VendorFolder%/%NAME%-Win-Install_Update.bes.mustache"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%-Update.bes"

  - Processor: com.github.jgstew.SharedProcessors/BESImport
