---
Description: Downloads the latest version of CATO
Identifier: com.github.jgstew.download.CATO-Mac
Input:
  NAME: "CATO"
  filename: CatoClient.pkg
MinimumVersion: "2.3"
Process:
  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      url: https://clientdownload.catonetworks.com/public/clients/CatoClient.pkg
      COMPUTE_HASHES: True

  - Processor: EndOfCheckPhase
    Arguments:
      prefetch_url: "%download_url%"

  # get SourceReleaseDate from HTTP `Last-Modified` header:
  - Processor: com.github.jgstew.SharedProcessors/DateTimeFromString
    Arguments:
      # parse last_modified header info from URLDownloaderPython
      datetime_string: "%last_modified%"
      datetime_strptime: "%a, %d %b %Y %H:%M:%S %Z"
      datetime_strftime: "%Y-%m-%d"
      datetime_parsed_name: SourceReleaseDate

  # one method to get version from URL:
  - Processor: com.github.jgstew.SharedProcessors/TextSearcher
    Arguments:
      input_string: "%download_url%"
      # example: https://clients.catonetworks.com/macos/5.10.6.6895/CatoClient.pkg
      re_pattern: 'macos/(?P<version>\d+(\.\d+)+)/'

  # another method to get version from PKG file:
  - Processor: com.github.jgstew.SharedProcessors/ExtractorSevenZip
    Arguments:
      extract_dir: "tmp"
      include_pattern: "*"

  - Processor: com.github.jgstew.SharedProcessors/ExtractorSevenZip
    Arguments:
      file_path: "%RECIPE_CACHE_DIR%/tmp/Payload~"
      extract_dir: "tmp"
      include_pattern: "*"

  # %RECIPE_CACHE_DIR%/tmp/CatoClient.app/Contents/Info.plist
  - Processor: com.github.jgstew.SharedProcessors/FileXmlXpath
    Arguments:
      pathname: "%RECIPE_CACHE_DIR%/tmp/CatoClient.app/Contents/Info.plist"
      xml_xpath: "//key[text()='CFBundleShortVersionString']/following-sibling::string[1]/text()"
      xml_only_first: True
