---
Description: Downloads the latest version of GitHub actions-runner
Identifier: com.github.jgstew.download.actions-runner-Win64
Input:
  NAME: "actions-runner"
  TYPE: "zip"
  OS: win-x64
  # this will be used as the asset regex patter, but then replaced by the real version downloaded
  version: ".*\\.\\d+"
MinimumVersion: "2.3"
ParentRecipe: com.github.jgstew.shared.parent-recipe
Process:
  # see: https://github.com/actions/runner/releases
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: actions/runner
      #  actions-runner-win-x64-2.289.2.zip
      asset_regex: "actions-runner-%OS%-%version%\\.%TYPE%$"
      include_prereleases: False
      # curl_opts: ["--raw"]
  - Processor: URLDownloaderPython
    Arguments:
      filename: actions-runner-%OS%.%TYPE%
      #download_version: "%version%"
      COMPUTE_HASHES: True
  - Processor: EndOfCheckPhase
  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem
