---
Description: Downloads the latest Chocolatey for Windows
Identifier: com.github.jgstew.download.Chocolatey-Win
Input:
  NAME: ChocolateyWin
MinimumVersion: '2.3'
Process:
  - Processor: URLDownloaderPython
    Arguments:
      url: https://chocolatey.org/api/v2/package/chocolatey
      prefetch_filename: True
      User_Agent: Mozilla/5.0 (Windows NT 6.1; Win64; x64; rv:47.0) Gecko/20100101 Firefox/47.0
  - Processor: EndOfCheckPhase
