---
Description: Downloads the latest WindowsAutoDarkMode
Identifier: com.github.jgstew.download.WindowsAutoDarkMode
Input:
  # Name: Short Name of the Software, No spaces, Example: "DBBrowserforSQLite"
  NAME: "WindowsAutoDarkMode"
  # DisplayName: The start of the DisplayName key in the Windows Registry, Example: "DB Browser for SQLite"
  DisplayName: "Auto Dark Mode"
# this is the minimum autopkg version:
MinimumVersion: "2.3"
Process:
  # `SharedUtilityMethods` must come first
  - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods

  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: AutoDarkMode/Windows-Auto-Night-Mode
      asset_regex: AutoDarkModeX_.+\.exe
      include_prereleases: false

  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      filename: AutoDarkModeX.exe
      download_version: ""
      COMPUTE_HASHES: True

  - Processor: EndOfCheckPhase

  - Processor: com.github.jgstew.SharedProcessors/DateTimeFromString
    Arguments:
      # parse last_modified header info from URLDownloaderPython
      datetime_string: "%last_modified%"
      datetime_strptime: "%a, %d %b %Y %H:%M:%S %Z"
      datetime_strftime: "%Y-%m-%d"
      datetime_parsed_name: SourceReleaseDate

  - Processor: com.github.jgstew.SharedProcessors/FileExeGetInfoPE
