---
Description: Downloads the latest VisualStudio Product BuildTools
Identifier: com.github.jgstew.bigfix.VisualStudioProductBuildTools-Win
Input:
  NAME: VisualStudioProductBuildTools-Win
MinimumVersion: '2.3'
ParentRecipe: com.github.jgstew.download.VisualStudioProductBuildTools-Win
Process:
  #- Processor: com.github.jgstew.SharedProcessors/StopProcessingIfDownloadUnchanged
  - Processor: com.github.jgstew.SharedProcessors/DangerousEvaluate
    Arguments:
      # verify TYPE is `gz` or `zip` otherwise HALT
      evaluate_string: 'from datetime import datetime ; self.env["yyyymmdd"] = datetime.strptime(self.env.get("last_modified", None), "%a, %d %b %Y %H:%M:%S %Z").strftime("%Y-%m-%d")'
  - Processor: com.github.jgstew.SharedProcessors/FileHasher
  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem
  - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: SourceReleaseDate
      append_value: "%yyyymmdd%"
  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      template_file_path: "Microsoft/VisualStudioProductBuildTools-Win-Install.bes.mustashe"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%.bes"
  - Processor: com.github.jgstew.SharedProcessors/BESImport
  - Processor: com.github.jgstew.SharedProcessors/BigFixActioner
