---
Description: Downloads the latest VisualStudio Product BuildTools
Identifier: com.github.jgstew.bigfix.VisualStudioProductBuildTools-Win
Input:
  NAME: VisualStudioProductBuildTools-Win
MinimumVersion: '2.3'
ParentRecipe: com.github.jgstew.download.VisualStudioProductBuildTools-Win
Process:
  #- Processor: com.github.jgstew.SharedProcessors/StopProcessingIfDownloadUnchanged
  - Processor: com.github.jgstew.SharedProcessors/FileHasher
  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem
  - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary
  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      append_key: SourceReleaseDate
      append_value: "%yyyymmdd%"
  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      template_file_path: "Microsoft/VisualStudioProductBuildTools-Win-Install.bes.mustashe"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%.bes"
  - Processor: com.github.jgstew.SharedProcessors/BESImport
