---
# https://github.com/autopkg/recipes/blob/master/AutoPkg/AutoPkgGitMaster.nupkg.recipe
Description: download zip for released AutoPkg
Identifier: com.github.jgstew.download.AutoPkgRelease
Input:
  NAME: autopkg
MinimumVersion: "2.3"
Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      # https://github.com/autopkg/autopkg/releases/tag/v2.4.1
      # https://github.com/autopkg/autopkg/archive/refs/tags/v2.4.1.zip
      github_repo: autopkg/autopkg
      #asset_regex: ".*.zip"
  - Processor: URLDownloader
    Arguments:
      url: "https://github.com/autopkg/autopkg/archive/refs/tags/v%version%.zip"
      filename: autopkg.zip
      request_headers: {"authorization": "Bearer %GITHUB_TOKEN%"}
      # COMPUTE_HASHES: True
      # https://github.community/t/using-github-token-in-http-call-to-api/16608/8?u=jgstew
      # authorization: Bearer <your token goes here>
  - Processor: EndOfCheckPhase
