---
# Based upon: https://github.com/cli/cli/blob/c4455297198031b8701544f5fff1b2621e57c454/.github/workflows/releases.yml#L130-L157
Description: Build Chocolatey package for released AutoPkg
Identifier: com.github.jgstew.msibuild.AutoPkg
Input:
  NAME: autopkg
MinimumVersion: "2.3"
# SupportedPlatforms:
#   - Windows
ParentRecipe: com.github.jgstew.download.AutoPkgReleaseSource
Process:
  #- Processor: com.github.jgstew.SharedProcessors/FileHasher
  - Processor: Copier
    Arguments:
      source_path: _Shared/ui.wxs
      destination_path: "%RECIPE_CACHE_DIR%/ui.wxs"
      overwrite: True
  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    # NOTE: this processor `ContentFromTemplate` requires: chevron
    # - pip install chevron
    Arguments:
      template_file_path: .templates/projectname.wixproj.mustache
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%.wixproj"
      template_dictionary: {"version": "%version%", "NAME": "%NAME%"}
  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    # NOTE: this processor `ContentFromTemplate` requires: chevron
    # - pip install chevron
    Arguments:
      template_file_path: .templates/projectname.wxs.mustache
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%.wxs"
      # yamllint disable rule:indentation
      template_dictionary: {
          "version": "%version%",
          "NAME": "%NAME%",
          "Manufacturer": "%NAME%",
          "EXEPATH": "autopkg",
          # example: 8CFB9531-B959-4E1B-AA2E-4AF0FFCC4AF4
          "GUID_x64": "3864F27C-F258-4195-8B6F-F93C5AA41A79",
          "GUID_x86": "44AF44FF-7531-4951-9657-53BB7A4B5D04",
          "GUID_arm64": "E78A87C5-E4CC-44FD-8A67-9ED5CDAE5C9F",
          "GUID_arm": "E0EABEC5-0F7A-4163-8500-D05E8A34DAB9",
        }
